InformationRegisters/УчетнаяПолитикаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПереходаНаУСН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийППИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийППИсходящее</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПостояннойЧастиАрендыАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПеременнойЧастиАрендыАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозитаАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПостояннойЧастиАрендыАрендатору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПеременнойЧастиАрендыАрендатору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДепозитаАрендатору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗППоВедомости</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписаниеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаУслугБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЭквайринга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЭквайрингаСводно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличныхСРасчетногоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПоИсполнительнымЛистам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСКорпоративныхКарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатаЗаОткрытиеКорпоративнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеДепозита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеБезналичныхДенежныхСредств</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДепозитаОтАрендодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНаКорпоративнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПеременнойЧастиАрендыОтАрендодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПостояннойЧастиАрендыОтАрендодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатаЗаОткрытиеКорпоративнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозитаОтАрендатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПеременнойЧастиАрендыОтАрендатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПостояннойЧастиАрендыОтАрендатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПоИсполнительнымЛистамПоступление</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияОтПродажиИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеПроцентовПоДепозиту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтФизЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эквайринг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайрингСводно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПостояннойЧастиАрендыАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПеременнойЧастиАрендыАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозитаАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПостояннойЧастиАрендыАрендатору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПеременнойЧастиАрендыАрендатору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДепозитаАрендатору</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровСФизЛицами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровСФизЛицами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Авторский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЛицензионный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорУправленческий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
					<Comment>ОСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
					<Comment>УСН</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗачетОплатыАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗачетОплатыАренды</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоДоговорамАренды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗачетДепозита</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипАренднойПлаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДепозита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/УправлениеОтчетамиПереопределяемый/Ext/Module.bsl
Функция АК_ПолучитьДатуНачалаАренды(ТорговаяТочка)
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТорговаяТочка", ТорговаяТочка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ВнутреннийЗапрос.Дата) КАК Дата
	|ИЗ
	|	(ВЫБРАТЬ
	|		НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Ссылка.Дата КАК Дата
	|	ИЗ
	|		Документ.НачислениеАренднойПлатыОтАрендодателей.НачислениеАренды КАК НачислениеАренднойПлатыОтАрендодателейНачислениеАренды
	|	ГДЕ
	|		НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.Ссылка.Проведен
	|		И НачислениеАренднойПлатыОтАрендодателейНачислениеАренды.СтруктурнаяЕдиница = &ТорговаяТочка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходИзБанка.Дата
	|	ИЗ
	|		Документ.РасходИзБанка КАК РасходИзБанка
	|	ГДЕ
	|		(РасходИзБанка.Проведен
	|					И РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю)
	|				ИЛИ РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПеременнойЧастиАрендыАрендодателю))
	|		И РасходИзБанка.ДоговорКонтрагента.ОбъектАренды.СтруктурнаяЕдиница = &ТорговаяТочка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеВБанк.Дата
	|	ИЗ
	|		Документ.ПоступлениеВБанк КАК ПоступлениеВБанк
	|	ГДЕ
	|		(ПоступлениеВБанк.Проведен
	|					И ПоступлениеВБанк.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратПостояннойЧастиАрендыОтАрендодателя)
	|				ИЛИ ПоступлениеВБанк.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратПеременнойЧастиАрендыОтАрендодателя))
	|		И ПоступлениеВБанк.ДоговорКонтрагента.ОбъектАренды.СтруктурнаяЕдиница = &ТорговаяТочка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходИзКассы.Дата
	|	ИЗ
	|		Документ.РасходИзКассы КАК РасходИзКассы
	|	ГДЕ
	|		(РасходИзКассы.Проведен
	|					И РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПостояннойЧастиАрендыАрендодателю)
	|				ИЛИ РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПеременнойЧастиАрендыАрендодателю))
	|		И РасходИзКассы.ДоговорКонтрагента.ОбъектАренды.СтруктурнаяЕдиница = &ТорговаяТочка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗачетОплатыАренды.Дата
	|	ИЗ
	|		Документ.ЗачетОплатыАренды.ЗачетДепозита КАК ЗачетОплатыАрендыЗачетДепозита
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗачетОплатыАренды КАК ЗачетОплатыАренды
	|			ПО (ЗачетОплатыАренды.Ссылка = ЗачетОплатыАрендыЗачетДепозита.Ссылка)
	|				И (ЗачетОплатыАренды.Проведен)
	|				И (ЗачетОплатыАренды.ТорговаяТочка = &ТорговаяТочка)) КАК ВнутреннийЗапрос";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.Дата), НачалоДня(Выборка.Дата), Дата(1, 1, 1));
	КонецЕсли;
	
	Возврат Дата(1, 1, 1);
	
КонецФункции

#Если Клиент Тогда
	
Процедура УстановитьОтбор(Отчет, Поле, Значение)
		Если Отчет.ЗначенияНастроекПанелиПользователя = Неопределено тогда
			Возврат;
		КонецЕсли;
		ЗначениеПользовательскойНастройки = Отчет.ЗначенияНастроекПанелиПользователя.Получить();
		Если ЗначениеПользовательскойНастройки = Неопределено тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеПользовательскойНастройки.ДинамическиеОтборы.Получить(Поле) <> Неопределено тогда
			Если ТипЗнч(ЗначениеПользовательскойНастройки.ДинамическиеОтборы.Получить(Поле).Значение) <> Тип("СписокЗначений") тогда
				ЗначениеПользовательскойНастройки.ДинамическиеОтборы.Получить(Поле).Значение = Значение;
				ЗначениеПользовательскойНастройки.ДинамическиеОтборы.Получить(Поле).Использование = истина;
			Иначе
				ЗначениеПользовательскойНастройки.ДинамическиеОтборы.Получить(Поле).Значение.Очистить();
				ЗначениеПользовательскойНастройки.ДинамическиеОтборы.Получить(Поле).Значение.Добавить(Значение);
				ЗначениеПользовательскойНастройки.ДинамическиеОтборы.Получить(Поле).Использование = истина;
			КонецЕсли;
		КонецЕсли;
		Отчет.ЗначенияНастроекПанелиПользователя = Новый ХранилищеЗначения(ЗначениеПользовательскойНастройки);
КонецПроцедуры
	
	
// Открывает форму отчета "РасчетныеЛистки" с переданным параметром
//
// Параметры: 
//  ТекущиеДанные -  строка в форме списка регистра расчетов
//  ИмяФормы - имя формы, из которой вызывается отчет
//
Процедура ВызовРасчетногоЛисткаИзФормыСпискаРР(ТекущиеДанные,ИмяФормы) Экспорт
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если Найти(ИмяФормы,"Организаций") > 0 Тогда 			
			РасчетныйЛисток	= Отчеты.РасчетныеЛисткиОрганизаций.Создать();
			РасчетныйЛисток.СохраненнаяНастройка = Справочники.СохраненныеНастройки.РасчетныеЛисткиОрганизаций;
			РасчетныйЛисток.ПрименитьНастройку();
			РасчетныйЛистокФорма = РасчетныйЛисток.ПолучитьФорму();
			РасчетныйЛистокФорма.Открыть();
			Если РасчетныйЛисток.ЗначенияНастроекПанелиПользователя = Неопределено тогда
				Если РасчетныйЛисток.ЗначенияНастроекПанелиПользователя.Получить().ДинамическиеОтборы.Количество() = 0 тогда
					РасчетныйЛисток.ЗначенияНастроекПанелиПользователя = Новый ХранилищеЗначения(ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователя(РасчетныйЛисток, РасчетныйЛистокФорма))
				КонецЕсли;
			КонецЕСли;
			РасчетныйЛистокФорма.ЭтоОтработкаРасшифровки = истина;
			УстановитьОтбор(РасчетныйЛисток, "Организация", ТекущиеДанные.ОбособленноеПодразделение);
		Иначе
			РасчетныйЛисток	= Отчеты.РасчетныеЛистки.Создать();	
			РасчетныйЛисток.СохраненнаяНастройка = Справочники.СохраненныеНастройки.РасчетныеЛистки;
			РасчетныйЛисток.ПрименитьНастройку();
			РасчетныйЛистокФорма = РасчетныйЛисток.ПолучитьФорму();
			РасчетныйЛистокФорма.Открыть();
			Если РасчетныйЛисток.ЗначенияНастроекПанелиПользователя = Неопределено тогда
				Если РасчетныйЛисток.ЗначенияНастроекПанелиПользователя.Получить().ДинамическиеОтборы.Количество() = 0 тогда
					РасчетныйЛисток.ЗначенияНастроекПанелиПользователя = Новый ХранилищеЗначения(ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователя(РасчетныйЛисток, РасчетныйЛистокФорма))
				КонецЕсли;
			КонецЕСли;
			РасчетныйЛистокФорма.ЭтоОтработкаРасшифровки = истина;
			УстановитьОтбор(РасчетныйЛисток, "Подразделение", ТекущиеДанные.Подразделение);
			
		КонецЕсли;
		
		ЗначенияНастроекПанелиПользователя = РасчетныйЛисток.ЗначенияНастроекПанелиПользователя.Получить();
		ЗначенияНастроекПанелиПользователя.СтандартныйПериод.ДатаНачала   = НачалоМесяца(ТекущиеДанные.ПериодРегистрации);
		ЗначенияНастроекПанелиПользователя.СтандартныйПериод.ДатаОкончания = КонецМесяца(ТекущиеДанные.ПериодРегистрации);
		РасчетныйЛисток.ЗначенияНастроекПанелиПользователя = Новый ХранилищеЗначения(ЗначенияНастроекПанелиПользователя);
		
		ТиповыеОтчеты.УстановитьПараметр(РасчетныйЛисток.КомпоновщикНастроек,  "Группировать",  ложь);
		
		Если Найти(ИмяФормы,"Удержания") > 0 или Найти(ИмяФормы,"Организаций") = 0 Тогда
			ТиповыеОтчеты.ДобавитьОтбор(РасчетныйЛисток.КомпоновщикНастроек, "ФизЛицо", ТекущиеДанные.ФизЛицо);
		Иначе
			УстановитьОтбор(РасчетныйЛисток, "Сотрудник", ТекущиеДанные.Сотрудник);
		КонецЕсли;
		
		ДокументРезультат = РасчетныйЛистокФорма.ЭлементыФормы.Результат;
		РасчетныйЛистокФорма.ОбновлениеОтображения();
		РасчетныйЛисток.СформироватьОтчет(ДокументРезультат);
		
	КонецЕсли;
	
КонецПроцедуры // ВызовРасчетногоЛисткаИзФормыСпискаРР()


///////////////////////////////////////////////
// АРЕНДА

Процедура ОткрытьОтчетПоАренднымПлатежам(ТорговаяТочка) Экспорт
	
	ФормаОтчета = ОткрытьФорму("Отчет.ОтчетПоАренднымПлатежам.Форма.ФормаОтчета");
	
	мНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки;
	мПараметрыДанных			= мНастройки.ПараметрыДанных;
	мЭлементыОтбора				= мНастройки.Отбор.Элементы;
	ЭлементыПользоватНастроек 	= ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	
	Идентификатор = мПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода")).ИдентификаторПользовательскойНастройки;
	ЭлементыПользоватНастроек.Найти(Идентификатор).Значение = АК_ПолучитьДатуНачалаАренды(ТорговаяТочка);
	
	Идентификатор = мПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода")).ИдентификаторПользовательскойНастройки;
	ЭлементыПользоватНастроек.Найти(Идентификатор).Значение = КонецДня(ТекущаяДата());  //
	
	ПолеКомпоновкиТТ = Новый ПолеКомпоновкиДанных("ТТ");
	Для Каждого ЭлементОтбора Из мЭлементыОтбора Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиТТ Тогда
			ЭлементНастройки = ЭлементыПользоватНастроек.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
			ЭлементНастройки.ПравоеЗначение = ТорговаяТочка;                  //
			ЭлементНастройки.Использование 	= Истина;
		КонецЕсли; 
	КонецЦикла;  
	
	ФормаОтчета.СкомпоноватьРезультат();
	
КонецПроцедуры

#КонецЕсли

///////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ОПРЕДЛЕНИЯ ОТЧЕТОВ УСТАНОВЛЕНЫХ НА ПОДДЕРЖКУ

//Процедура ИсполнениеКадровогоПланаПриСозданииОтчета(ОтчетОбъект) Экспорт
//	
//	РежимНабораПерсонала = ПроцедурыУправленияПерсоналомДополнительный.ПолучитьРежимНабораПерсонала();

//	Если РежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоЦентрамОтветственности Тогда
//		ОтчетОбъект.СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ПоЦентрамОтветственности");
//	Иначе
//		ОтчетОбъект.СхемаКомпоновкиДанных.НаборыДанных.ИсполнениеКадровогоПлана.Запрос = СтрЗаменить(ОтчетОбъект.СхемаКомпоновкиДанных.НаборыДанных.ИсполнениеКадровогоПлана.Запрос, "ШтатноеРасписаниеОрганизацийСрезПоследних.Должность", "ШтатноеРасписаниеОрганизацийСрезПоследних.Должность.Должность");
//		ОтчетОбъект.СхемаКомпоновкиДанных.НаборыДанных.ИсполнениеКадровогоПлана.Запрос = СтрЗаменить(ОтчетОбъект.СхемаКомпоновкиДанных.НаборыДанных.ИсполнениеКадровогоПлана.Запрос, "ШтатноеРасписаниеОрганизаций.Должность", "ШтатноеРасписаниеОрганизаций.Должность.Должность");
//		ОтчетОбъект.СхемаКомпоновкиДанных.НаборыДанных.ИсполнениеКадровогоПлана.Запрос = СтрЗаменить(ОтчетОбъект.СхемаКомпоновкиДанных.НаборыДанных.ИсполнениеКадровогоПлана.Запрос, "ЗанятыеШтатныеЕдиницыОрганизаций.Должность", "ЗанятыеШтатныеЕдиницыОрганизаций.Должность.Должность");
//		ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(ОтчетОбъект.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
//	КонецЕсли;
//	
//КонецПроцедуры


// Процедура устанавливает параметр СКД отчета Вид договора соответсвующим списком значений видов трудовых договоров

Процедура ОценкиКомпетенцийРаботниковДоработкаКомпоновщика(ОтчетОбъект) Экспорт
	#Если Клиент ИЛИ ВнешнееСоединение Тогда
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий);
	СписокЗначений.Добавить(Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор);
	Параметр = ТиповыеОтчеты.УстановитьПараметр(ОтчетОбъект.КомпоновщикНастроек, "ВидДоговора", СписокЗначений);
	Параметр.Использование = истина;
	#КонецЕсли
КонецПроцедуры

Процедура ОценкиКомпетенцийРаботниковПриСозданииОтчета(ОтчетОбъект) Экспорт
	ТЗ = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиСрезПоследних.ФизЛицо КАК Измерение,
	|	РаботникиСрезПоследних.Подразделение КАК Подразделение,
	|	РаботникиСрезПоследних.Должность КАК Должность
	|ПОМЕСТИТЬ ПодразделениеДолжность
	|ИЗ
	|	РегистрСведений.Работники.СрезПоследних(&КонецПериода, ) КАК РаботникиСрезПоследних";
		 
	СтрокаЗамены = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	"""" КАК Измерение,
	|	"""" КАК Подразделение,
	|	"""" КАК Должность
	|ПОМЕСТИТЬ ПодразделениеДолжность";
	ОтчетОбъект.СхемаКомпоновкиДанных.НаборыДанных.ОценкиКомпетенцийРаботников.Запрос = СтрЗаменить(ОтчетОбъект.СхемаКомпоновкиДанных.НаборыДанных.ОценкиКомпетенцийРаботников.Запрос, СтрокаЗамены, ТЗ);
КонецПроцедуры

Процедура ПройденныеКурсыОбученияДоработкаКомпоновщика(ОтчетОбъект) Экспорт
	#Если Клиент ИЛИ ВнешнееСоединение Тогда
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор);
	СписокЗначений.Добавить(Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий);
	Параметр = ТиповыеОтчеты.УстановитьПараметр(ОтчетОбъект.КомпоновщикНастроек, "ВидДоговора", СписокЗначений);
	Параметр.Использование = истина;
	#КонецЕсли
КонецПроцедуры

Процедура РазвитиеКомпетенцийДоработкаКомпоновщика(ОтчетОбъект) Экспорт
	#Если Клиент ИЛИ ВнешнееСоединение Тогда
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор);
	СписокЗначений.Добавить(Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий);
	Параметр = ТиповыеОтчеты.УстановитьПараметр(ОтчетОбъект.КомпоновщикНастроек, "ВидДоговора", СписокЗначений);
	Параметр.Использование = истина;
	#КонецЕсли
КонецПроцедуры

Процедура ДобавитьУчетнуюПолитикуПОУСНДляРасчетаСреднесписочнойЧисленности(СхемаКомпоновкиДанных) Экспорт
	СхемаКомпоновкиДанных.НаборыДанных.МесяцыУСН.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.МесяцыУСН.Запрос, "ЛОЖЬ КАК УСН", "УчетнаяПолитикаНалоговыйУчет.УСН");
КонецПроцедуры


Процедура УстановитьСКДОтчетСостояниеКадровогоПлана(ОтчетОбъект) Экспорт 
	
	Если Константы.РежимНабораПерсонала.Получить() = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоЦентрамОтветственности Тогда
		ОтчетОбъект.СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ПоЦентрамОтветственности");
		ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(ОтчетОбъект.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	
Конецпроцедуры

Функция ДоступныеНастройкиДляСостоянияКадровогоПлана() Экспорт
	
	ИспользоватьУправленческийУчетЗарплаты = Константы.РежимНабораПерсонала.Получить() = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоЦентрамОтветственности;
	
	СписокНастроек = Новый СписокЗначений;
	Если ИспользоватьУправленческийУчетЗарплаты Тогда
		СписокНастроек.Добавить(Справочники.СохраненныеНастройки.СостояниеКадровогоПлана);
	Иначе
		СписокНастроек.Добавить(Справочники.СохраненныеНастройки.СостояниеКадровогоПланаОрганизации);
	КонецЕсли;	

	Возврат СписокНастроек;
КонецФункции

Функция ПодставитьЗапросДляПолученияНалоговойПолитики(ТекстЗапроса) Экспорт
	
	ТекстЗамены = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	              |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	              |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ПустаяСсылка) КАК ВидТарифаСтраховыхВзносов,
	              |	ЛОЖЬ КАК УплачиватьДобровольныеВзносыВФСС,
	              |	ЛОЖЬ КАК ОрганизацияЯвляетсяПлательщикомЕНВД
	              |ПОМЕСТИТЬ ВТНалоговыйУчет";
	
	ТекстНовый = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	УчетнаяПолитикаНалоговыйУчет.Период,
	             |	УчетнаяПолитикаНалоговыйУчет.Организация,
	             |	УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	             |	УчетнаяПолитикаНалоговыйУчет.УплачиватьДобровольныеВзносыВФСС,
	             |	ЕСТЬNULL(ВЫБОР
	             |			КОГДА УчетнаяПолитикаНалоговыйУчет.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ ЛОЖЬ
	             |		КОНЕЦ, ЛОЖЬ) КАК УСН,
	             |	УчетнаяПолитикаНалоговыйУчет.ОрганизацияЯвляетсяПлательщикомЕНВД
	             |ПОМЕСТИТЬ ВТНалоговыйУчет
	             |ИЗ
	             |	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаНалоговыйУчет";
	
	Возврат СтрЗаменить(ТекстЗапроса,ТекстЗамены, ТекстНовый);  
	
КонецФункции

Процедура НастроитьТипИДоступностьПолейОтчетаПоЗаявкамКандидатов(СхемаКомпоновкиДанных) Экспорт
	
	РежимНабораПерсонала = Константы.РежимНабораПерсонала.Получить();
	МассивТипов = Новый Массив;
	
	Если РежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц Тогда
		ПолеНабора = СхемаКомпоновкиДанных.НаборыДанных.ЗаявкиСоискателей.Поля.Найти("Организация");
		ПолеНабора.ОграничениеИспользования.Группировка = Истина; 
		ПолеНабора.ОграничениеИспользования.Поле        = Истина; 
		ПолеНабора.ОграничениеИспользования.Порядок     = Истина; 
		ПолеНабора.ОграничениеИспользования.Условие     = Истина; 
		МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	Иначе
		МассивТипов.Добавить(Тип("СправочникСсылка.Подразделения"));
	КонецЕсли;	
	
	ПолеНабора = СхемаКомпоновкиДанных.НаборыДанных.ЗаявкиСоискателей.Поля.Найти("Подразделение");
	ОписаниеТипаПодразделения = Новый ОписаниеТипов(МассивТипов);			
	ПолеНабора.ТипЗначения = ОписаниеТипаПодразделения;
	
КонецПроцедуры

Процедура НастроитьДоступностьВариантовОтчетаПоЗаявкамКандидатов(СхемаКомпоновкиДанных, СтруктураНаcтроек) Экспорт
	
	СписокПолейПодстановкиОтборовПоУмолчанию = Новый Соответствие;
	
	РежимНабораПерсонала = Константы.РежимНабораПерсонала.Получить();
	
	СписокНастроек = Новый СписокЗначений;
	Если РежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц Тогда
		СписокПолейПодстановкиОтборовПоУмолчанию.Вставить("Организация", "ОсновнаяОрганизация");
		СписокНастроек.Добавить(Справочники.СохраненныеНастройки.ОтчетПоЗаявкамКандидатов);
	Иначе
		СписокНастроек.Добавить(Справочники.СохраненныеНастройки.ОтчетПоЗаявкамКандидатовУправленческий);
	КонецЕсли;	

	СтруктураНаcтроек.ЗаполнитьОтборыПоУмолчанию = истина;
	СтруктураНаcтроек.СписокПолейПодстановкиОтборовПоУмолчанию = СписокПолейПодстановкиОтборовПоУмолчанию;
	СтруктураНаcтроек.СписокДоступныхПредопределенныхНастроек = СписокНастроек;
	
КонецПроцедуры
